---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Lighting.RectangleLightShape
source: html/544012d5-0f2f-fbe7-af52-bc8984d2a5db.htm
---
# RectangleLightShape Members

Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.